import javax.swing.JOptionPane;
import java.io.BufferedReader;
import java.io.IOException;
import java.io.InputStreamReader;
import java.util.ArrayList;
import java.util.Scanner;
import java.awt.event.*;
import java.awt.*;
import javax.swing.*;

import java.awt.event.*;
import java.util.ArrayList;
import java.awt.*;
import javax.swing.*;
public class interfaseg extends JFrame{



		private JButton button = new JButton("Играть");
        private JButton button2 = new JButton("Разрабы");
private JLabel label = new JLabel ("                                                                        Выберите главу:");
private JLabel label2 = new JLabel ("   ... DAMASCUS SWORD");
private JRadioButton radio1 =new JRadioButton("1 глава");
private JRadioButton radio2 =new JRadioButton("2 глава");
private JRadioButton radio3 =new JRadioButton("3 глава");

public static boolean rt;
public interfaseg () {

	super("DAMASCUS SWORD");

	this.setBounds(600,600,600,600);
	this.setDefaultCloseOperation(JFrame.EXIT_ON_CLOSE);
	Container container = this.getContentPane();
	Container container2 = this.getContentPane();
	Container container3 = this.getContentPane();
	container.setLayout(new GridLayout(7,7,3,3));
	container2.setLayout(new GridLayout(2,3,8,8));
	 container.add(label);
	 button.setBackground(Color.yellow);
     container.add(button);   container3.add(radio1);
     container3.add(radio2);
     container3.add(radio3);
     radio1.setSelected(false);
     radio2.setSelected(false);
     radio3.setSelected(false);


    button.addActionListener(new ButtonEventListener());
     container.add(button);


       button2.addActionListener(new ButtonEventListener2());
			     container2.add(button2);
		  container.add(label2);

    	}
class ButtonEventListener2 implements ActionListener{
					public void actionPerformed(ActionEvent w) {
						String message  ="";
						message +="DAMASCUS SWORD\n";
						message+="Авторы:Андрей Романович Ежель,Анна Горовенко  \n";
						message +="Сценнарий:Анна Горовенко\n";
						message +="Программист:Андрей Романович Ежель\n";
						message +="Дизайнер:Андрей Романович Ежель\n";
						message +="Помощь: Сообщество в ВК\\\"Damascus Steel\\\"\n";
						message +="Благодарности:Comzaw,JST.\n";
						JOptionPane.showMessageDialog(null,message,message, JOptionPane.PLAIN_MESSAGE);


}}

			class ButtonEventListener  implements ActionListener{




				public void actionPerformed(ActionEvent y) {

			int else1 = 0 ;
			String messager = "";


		        		messager += (radio1.isSelected() ? else1 += 1 :"")+"\n";
		        		messager += (radio2.isSelected() ? else1 += 2 :"")+"\n";
		        		messager += (radio3.isSelected() ? else1 += 3 :"")+"\n";


			 switch (else1) {
			 case 1:
				 messager = "1 ГЛАВА"+"\n"+"Начало\n";
			 JOptionPane.showMessageDialog(null, "▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\n"+"▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀░░░░░▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\n"+"▀▀▀▀▀▀▀▀▀▀▀░░░░░░░░░▀░░░░░░░░░▀▀▀▀▀▀▀▀▀▀\n"+"▀▀▀▀▀▀▀▀░░░░░░░░░░▀▀▀▀▀░░░░░░░░░░▀▀▀▀▀▀▀\n"+"▀▀▀▀▀▀▀░░░░░░▀▀▀▀░░▀▀▀░░▀▀▀▀░░░░░░▀▀▀▀▀▀\n"+"▀▀▀▀▀▀░░▀▀░░░▀▀▀░░░░░░░░░▀▀▀░░░▀▀░░▀▀▀▀▀\n"+"▀▀▀▀▀▀░▀▀▀▀░░░░░░░░░░░░░░░░░░░▀▀▀▀░▀▀▀▀▀\n"+"▀▀▀▀▀░░░▀▀░░░░░░▀▀░░░░░▀▀░░░░░░▀▀░░░▀▀▀▀\n"+"▀▀▀▀▀░░░░░░░░░░░░░▀▀░▀▀░░░░░░░░░░░░░▀▀▀▀\n"+"▀▀▀▀▀▀░░░░░▀▀▀▀░░░░▀▀▀░░░░▀▀▀▀░░░░░▀▀▀▀▀\n"+"▀▀▀▀▀▀░░░▀▀▀▀▀▀▀▀░░░░░░░▀▀▀▀▀▀▀▀░░░▀▀▀▀▀\n"+"▀▀▀▀▀▀░▀▀▀░░░░░░▀▀▀░░░▀▀▀░░░░░░▀▀▀░▀▀▀▀▀\n"+"▀▀▀▀▀▀░░▀▀▀░░░░▀▀▀░░▀░░▀▀▀░░░░▀▀▀░░▀▀▀▀▀\n"+"▀▀▀▀░▀▀░░░▀▀▀▀▀▀░░░░▀░░░░▀▀▀▀▀▀░░░▀▀░▀▀▀\n"+"▀▀▀░░▀▀░░░░░░░░░▀▀░░▀░░▀▀░░░░░░░░░▀▀░░▀▀\n"+"▀▀░░▀▀▀▀░░░░▀▀▀▀░░░▀▀▀░░░▀▀▀▀░░░░▀▀▀▀░░▀\n"+"▀▀░▀▀▀▀▀░░░▀▀░░░▀▀░▀▀▀░▀▀░░░▀▀░░░▀▀▀▀▀░▀\n"+"▀▀░▀▀▀▀▀▀░░░░▀▀▀▀░░░░░░░▀▀▀▀░░░░▀▀▀▀▀▀░▀\n"+"▀▀░▀▀▀▀▀░▀░░░░░░░░░░░░░░░░░░░░░▀░▀▀▀▀▀░▀\n"+"▀▀░░▀▀▀░░▀▀░░░░░▀▀▀▀▀▀▀▀▀░░░░░▀▀░░▀▀▀░░▀\n"+messager,messager, JOptionPane.PLAIN_MESSAGE);


					JOptionPane.showMessageDialog(null,"░░░░░░░░░░░░░░░░░░\n"+"░░░░▓▓▀▀██████▓▄▒▒░░░\n"+"░░░▀░░░░░░▀▀▀████▄▒░░░\n"+"░░▌░░░░░░░░░░░▀███▓▒░░\n"+"░▌░░░░░▄▄▄░░░░░░▐█▓▒░░░\n"+"░▄▓▀█▌░▀██▀▒▄░░░▐▓▓▓▒░\n"+"░█▌░░░░░▀▒░░░▀░░░▐▓▒▒░░\n"+"░▌▀▒▄▄░░░░░░░░░░░░░▄▒░░\n"+"░▒▄█████▌▒▒░░░░░░░▒▌▒░\n"+"░░▓█████▄▒░▒▒▒░░░░░▐░\n"+"░░▒▀▓▒░░░░░░░▒▒░▒▒▒▄░\n"+"░░▓▒▒▒░░░░░░▒▒▒▒▒░▓░░\n"+"░░████▄▄▄▄▓▓▓▒▒░░▐░░\n"+"░░░▀██████▓▒▒▒▒▒░▐░\n"+"\n"+"Вы путешественник передвигающиеся Автостопом в другие страны\n"+"Смелый и отважный но,\n"+"как то раз машина перевернулась.\n","", JOptionPane.PLAIN_MESSAGE);
					JOptionPane.showMessageDialog(null,"░░░░░░░░░░░▀█▄░░░░░░░░░░░░░░░░░░░░░\n"+"░░░░░░░░░░░░░█▄░░░▄▄▄░░░░░░░░░░░░░░\n"+"░░░░░░░░░░░▄▄██░░████▄░░░░░░░░░░░░░\n"+"░░░░░░░░░░▄▄████▄█████░░░░░░░░░░░░░\n"+"░░░░░░░░░░░░░░████████▄░░░░░░░░░░░░\n"+"░░░░░░░░░░░░░████████░░░░░░░░░░░░░░\n"+"░░░░░░░░░░░░░▀██████▀░░░░░▄▄▄▄▄██▀░\n"+"░░░░░░░░░░░░░░░██████▄░░░▄▀▀▀▀▀▀█░░\n"+"░░░░░░░░░░░░░░░██████████▄▄▄░░░▀█░░\n"+"░░░░░░░░░░░░░░░██████████████▄░░█░░\n"+"░░░░░░░░░░░░░░░░███████████████░░█░\n"+"░░░░░░░░░░░░░░░░█████████████▀░░█░░\n"+"░░░░░░░░░░░░░░░██████████▀▀░░░█░░░░\n"+"░░░░░░░░░░░░░░░█████▀░░░▄▄█▀░░░░░░░\n"+"░░░░░░░░░░░░░░░░██████▀░░▄███▀░░░░░\n"+"░░░░░░░░░░░░░░░████░░░░████▀░░░░░░░\n"+"░░░░░░░░░░░░░░░░█░░░░▄▄███▀░░░░░░░░\n"+"░░░░░░░░░░░░░░░░█▄▄▄█████▀░░░░░░░░░\n"+"░░░░░░░░░░░░░░░░░░███████░░░░░░░░░░\n"+"░░░░░░░░░░░░░░░░░░░▄█▀░░░░░░░░░░░░░\n"+"\n"+"?:Пойдем со мной я покажу тебе \n","",JOptionPane.PLAIN_MESSAGE);
			        JOptionPane.showMessageDialog(null,"░░░░░░░░░░░░░░░░░░\n"+"░░░░▓▓▀▀██████▓▄▒▒░░░\n"+"░░░▀░░░░░░▀▀▀████▄▒░░░\n"+"░░▌░░░░░░░░░░░▀███▓▒░░\n"+"░▌░░░░░▄▄▄░░░░░░▐█▓▒░░░\n"+"░▄▓▀█▌░▀██▀▒▄░░░▐▓▓▓▒░\n"+"░█▌░░░░░▀▒░░░▀░░░▐▓▒▒░░\n"+"░▌▀▒▄▄░░░░░░░░░░░░░▄▒░░\n"+"░▒▄█████▌▒▒░░░░░░░▒▌▒░\n"+"░░▓█████▄▒░▒▒▒░░░░░▐░\n"+"░░▒▀▓▒░░░░░░░▒▒░▒▒▒▄░\n"+"░░▓▒▒▒░░░░░░▒▒▒▒▒░▓░░\n"+"░░████▄▄▄▄▓▓▓▒▒░░▐░░\n"+"░░░▀██████▓▒▒▒▒▒░▐░\n"+"\n"+"Кажется пол проваливается\n"+"АААААААААААА!\n","", JOptionPane.PLAIN_MESSAGE);
			        JOptionPane.showMessageDialog(null,"░░░░░░░░░░░░░░░░░░\n"+"░░░░▓▓▀▀██████▓▄▒▒░░░\n"+"░░░▀░░░░░░▀▀▀████▄▒░░░\n"+"░░▌░░░░░░░░░░░▀███▓▒░░\n"+"░▌░░░░░▄▄▄░░░░░░▐█▓▒░░░\n"+"░▄▓▀█▌░▀██▀▒▄░░░▐▓▓▓▒░\n"+"░█▌░░░░░▀▒░░░▀░░░▐▓▒▒░░\n"+"░▌▀▒▄▄░░░░░░░░░░░░░▄▒░░\n"+"░▒▄█████▌▒▒░░░░░░░▒▌▒░\n"+"░░▓█████▄▒░▒▒▒░░░░░▐░\n"+"░░▒▀▓▒░░░░░░░▒▒░▒▒▒▄░\n"+"░░▓▒▒▒░░░░░░▒▒▒▒▒░▓░░\n"+"░░████▄▄▄▄▓▓▓▒▒░░▐░░\n"+"░░░▀██████▓▒▒▒▒▒░▐░\n"+"\n"+"Где я кажется в лесу?\n"+"Но почему вместо деревьев гигантские грибы?\n"+"Да ещё и разноцветные?\n"+"Ладно,надо идти осмотреться.\n","", JOptionPane.PLAIN_MESSAGE);
			        JOptionPane.showMessageDialog(null,"░░░░░░░░░░░░░░░░░░\n"+"░░░░▓▓▀▀██████▓▄▒▒░░░\n"+"░░░▀░░░░░░▀▀▀████▄▒░░░\n"+"░░▌░░░░░░░░░░░▀███▓▒░░\n"+"░▌░░░░░▄▄▄░░░░░░▐█▓▒░░░\n"+"░▄▓▀█▌░▀██▀▒▄░░░▐▓▓▓▒░\n"+"░█▌░░░░░▀▒░░░▀░░░▐▓▒▒░░\n"+"░▌▀▒▄▄░░░░░░░░░░░░░▄▒░░\n"+"░▒▄█████▌▒▒░░░░░░░▒▌▒░\n"+"░░▓█████▄▒░▒▒▒░░░░░▐░\n"+"░░▒▀▓▒░░░░░░░▒▒░▒▒▒▄░\n"+"░░▓▒▒▒░░░░░░▒▒▒▒▒░▓░░\n"+"░░████▄▄▄▄▓▓▓▒▒░░▐░░\n"+"░░░▀██████▓▒▒▒▒▒░▐░\n"+"\n"+"Иду уже час и не понимаю почему и где я оказался?\n"+"На вид все такое необычное даже можно сказать что здесь всё такое волшебное \n"+"АААЙЙЙЙЙЙЙЙЙЙЙ! кажется я попал в капкан\n"+"О НЕТ! кто это!\n","", JOptionPane.PLAIN_MESSAGE);
			        JOptionPane.showMessageDialog(null,"┈┈┈╱▔▔╱╲┈▂▂▂\n"+"┈┈▕▔▇▔▎▕╱╲╲╲╲\n"+"┈┈╱▔▔▔▔╱▂▂╲╲╲╲\n"+"┈▕▔▔▔▔▕▎╳╳▕███\n"+"┈▕▕▉▕▔▕▎▇▇▕███\n"+"〰〜▔〰〜▔〜〰▔〰▔〜〰〜〜〰\n"+"\n"+"А? что?Где Я?Почему я в какой-то деревне\n"+"Точно меня же кто-то схватил, но кто?\n"+"Оглядевшись по сторонам я увидел каких-то \n"+"Зелённых существ и увидел какую-то табличку\n"+"С надписью \\\"Столовая для Троллей\\\"\n"+"Так вот кто-это Тролли\n"+"Но откуда они взялись?\n"+"Мне нужно в этом разобраться!\n","", JOptionPane.PLAIN_MESSAGE);
			        JOptionPane.showMessageDialog(null,"┈┈┈┈┈┈╱▔╲┈┈▅\n"+"┈┈┈┈▂╱╲╱▔╲╱╲▔╲\n"+"┈┈┈▕╲▂╱▔▔╱╱╱▔▔╲\n"+"┈▔▔▕┊▋▏▇▇╲╱╱▔▔╲╲\n"+"┈┈╲┈╲▋▏┊▕┊▍▔▉▍▔┃\n"+"┈┈╲┈╲▋▏┊▕┊▍▔▉▍▔┃\n"+"┈┈┈╲▍┈▔▔▔╲▍▎▉▍▎┃\n"+"┈┈┈┈▔▔▔▔╲▍┈▔▔▔▔┈┈\n"+"\n"+"Ещё оглядевшись я увидел дом\n"+"на вид он был деревянным,с камменной престройкой.\n","", JOptionPane.PLAIN_MESSAGE);
			        JOptionPane.showMessageDialog(null,"░░░░░░░░░░░░░░░░░░\n"+"░░░░▓▓▀▀██████▓▄▒▒░░░\n"+"░░░▀░░░░░░▀▀▀████▄▒░░░\n"+"░░▌░░░░░░░░░░░▀███▓▒░░\n"+"░▌░░░░░▄▄▄░░░░░░▐█▓▒░░░\n"+"░▄▓▀█▌░▀██▀▒▄░░░▐▓▓▓▒░\n"+"░█▌░░░░░▀▒░░░▀░░░▐▓▒▒░░\n"+"░▌▀▒▄▄░░░░░░░░░░░░░▄▒░░\n"+"░▒▄█████▌▒▒░░░░░░░▒▌▒░\n"+"░░▓█████▄▒░▒▒▒░░░░░▐░\n"+"░░▒▀▓▒░░░░░░░▒▒░▒▒▒▄░\n"+"░░▓▒▒▒░░░░░░▒▒▒▒▒░▓░░\n"+"░░████▄▄▄▄▓▓▓▒▒░░▐░░\n"+"░░░▀██████▓▒▒▒▒▒░▐░"+"\n"+"Тут ко мне приходит чудовище: зеленное и страшное ,как сама смерть\n "+"Смотрю не понимаю чего оно от меня хочет .\n","", JOptionPane.PLAIN_MESSAGE);
			        JOptionPane.showMessageDialog(null,"███████████████████▀▀███████████████████\n"+"██████████████████▀░░▀██████████████████\n"+"█████████████▀▀▀▀▀█▄▄█▀▀▀▀▀█████████████\n"+"██████████▀▀░░░░░░░░░░░░░░░░▀▀██████████\n"+"██████████░▄▄▄░░░▄░░░░▄░░░▄▄▄░██████████\n"+"██████████░░▀▀██▄▀▀██▀▀▄██▀▀░░██████████\n"+"██▀▀▀████░░█▄░░░▀▀█░░██▀░░░▄█░░████▀▀▀██\n"+"██▄░░░░██░░░▀██▄▄▄▄██▄▄▄▄██▀░░░██░░░░▄██\n"+"████░▀███░░░░█▄████▀▀████▄█░░░░███▀░████\n"+"█████▄░██░█▄░░▀▀██░░░░█▄▀▀░░▄█░██░▄█████\n"+"██████▄██░▀███▄░▀██▄▄██▀░▄███▀░██▄██████\n"+"█████████░░██░▀██▄░░░░▄██▀░██░░█████████\n"+"█████████░░▄██████▀▀▀▀██████▄░░█████████\n"+"█████████▄██▀░▄▄▄██████▄▄▄░▀██▄█████████\n"+"█████████▄██▀░▄▄▄██████▄▄▄░▀██▄█████████\n"+"████████████░░▀░░░░░░░░░░▀░░████████████\n"+"█████████████▄▄░░░░░░░░░░▄▄█████████████\n"+"████████████████████████████████████████\n"+"\n"+"Троль:Эй ты жалкое что бы то нибыло!\n"+"Вставай вон туда!\n","", JOptionPane.PLAIN_MESSAGE);
			        JOptionPane.showMessageDialog(null,"░░░░░░░░░░░░░░░░░░\n"+"░░░░▓▓▀▀██████▓▄▒▒░░░\n"+"░░░▀░░░░░░▀▀▀████▄▒░░░\n"+"░░▌░░░░░░░░░░░▀███▓▒░░\n"+"░▌░░░░░▄▄▄░░░░░░▐█▓▒░░░\n"+"░▄▓▀█▌░▀██▀▒▄░░░▐▓▓▓▒░\n"+"░█▌░░░░░▀▒░░░▀░░░▐▓▒▒░░\n"+"░▌▀▒▄▄░░░░░░░░░░░░░▄▒░░\n"+"░▒▄█████▌▒▒░░░░░░░▒▌▒░\n"+"░░▓█████▄▒░▒▒▒░░░░░▐░\n"+"░░▒▀▓▒░░░░░░░▒▒░▒▒▒▄░\n"+"░░▓▒▒▒░░░░░░▒▒▒▒▒░▓░░\n"+"░░████▄▄▄▄▓▓▓▒▒░░▐░░\n"+"░░░▀██████▓▒▒▒▒▒░▐░\n"+"\n"+"Он показал какую-то группу на вид тоже троллей\n"+"Подошёл туда и вижу тролли вроде а встревожены чем-то?\n","", JOptionPane.PLAIN_MESSAGE);
			        JOptionPane.showMessageDialog(null,"███████████████████▀▀███████████████████\n"+"██████████████████▀░░▀██████████████████\n"+"█████████████▀▀▀▀▀█▄▄█▀▀▀▀▀█████████████\n"+"██████████▀▀░░░░░░░░░░░░░░░░▀▀██████████\n"+"██████████░▄▄▄░░░▄░░░░▄░░░▄▄▄░██████████\n"+"██████████░░▀▀██▄▀▀██▀▀▄██▀▀░░██████████\n"+"██▀▀▀████░░█▄░░░▀▀█░░██▀░░░▄█░░████▀▀▀██\n"+"██▄░░░░██░░░▀██▄▄▄▄██▄▄▄▄██▀░░░██░░░░▄██\n"+"████░▀███░░░░█▄████▀▀████▄█░░░░███▀░████\n"+"█████▄░██░█▄░░▀▀██░░░░█▄▀▀░░▄█░██░▄█████\n"+"██████▄██░▀███▄░▀██▄▄██▀░▄███▀░██▄██████\n"+"█████████░░██░▀██▄░░░░▄██▀░██░░█████████\n"+"█████████░░▄██████▀▀▀▀██████▄░░█████████\n"+"█████████▄██▀░▄▄▄██████▄▄▄░▀██▄█████████\n"+"█████████▄██▀░▄▄▄██████▄▄▄░▀██▄█████████\n"+"████████████░░▀░░░░░░░░░░▀░░████████████\n"+"█████████████▄▄░░░░░░░░░░▄▄█████████████\n"+"████████████████████████████████████████\n"+"Тут подошел ещё какой-то тролль\n"+" со всего голоса воскликнул:\"Вы жалкие рабы пойдёте на войну за наших с гоблинами которые заплатят за всё.\"\n","", JOptionPane.PLAIN_MESSAGE);
			        JOptionPane.showMessageDialog(null,"░░░░░░░░░░░░░░░░░░\n"+"░░░░▓▓▀▀██████▓▄▒▒░░░\n"+"░░░▀░░░░░░▀▀▀████▄▒░░░\n"+"░░▌░░░░░░░░░░░▀███▓▒░░\n"+"░▌░░░░░▄▄▄░░░░░░▐█▓▒░░░\n"+"░▄▓▀█▌░▀██▀▒▄░░░▐▓▓▓▒░\n"+"░█▌░░░░░▀▒░░░▀░░░▐▓▒▒░░\n"+"░▌▀▒▄▄░░░░░░░░░░░░░▄▒░░\n"+"░▒▄█████▌▒▒░░░░░░░▒▌▒░\n"+"░░▓█████▄▒░▒▒▒░░░░░▐░\n"+"░░▒▀▓▒░░░░░░░▒▒░▒▒▒▄░\n"+"░░▓▒▒▒░░░░░░▒▒▒▒▒░▓░░\n"+"░░████▄▄▄▄▓▓▓▒▒░░▐░░\n"+"░░░▀██████▓▒▒▒▒▒░▐░\n"+"\n"+"Он отправил нас в какую-то крепость, вроде ,но я думаю, надо как нибудь сбежать.","", JOptionPane.PLAIN_MESSAGE);
				break;

			 case 2 :
					String message = "";
					message = "2 ГЛАВА"+"\n"+"Это время\n";
					 JOptionPane.showMessageDialog(null,"████████████████████████████████████████\n"+"██████████████████▀▀▀▀██████████████████\n"+"███████████████▀▀░░░░░░▀▀███████████████\n"+"██████████████░░░░░░░░░░░░██████████████\n"+"████████████▀░░░░░░░░░░░░░░▀████████████\n"+"███████████░░█▄░░░░░░░░░░▄█░░███████████\n"+"██▄░░▀█████▄░░▀▀█▄▄░░▄▄█▀▀░░▄█████▀░░▄██\n"+"████▄░░░██░██▄▄▄░░░░░░░░▄▄▄██░██░░░▄████\n"+"█████▄░░▀█░██░██▀██░░██▀██░██░█▀░░▄█████\n"+"███████░▄█▀██▀▀▀██▀░░▀██▀▀▀██▀█▄░███████\n"+"████████▀░░░░░░░░▀█░░█▀░░░░░░░░▀████████\n"+"██████████▄▄▄░░▄█░████░█▄░░▄▄▄██████████\n"+"█████████▄▀█▀▀███▄░██░▄███▀▀█▀▄█████████\n"+"██████████▄▀███░█▀▀██▀▀█░███▀▄██████████\n"+"███████████▄░▀▀███░██░███▀▀░▄███████████\n"+"████████████▄░░░▀█▄██▄█▀░░░▄████████████\n"+"██████████████▄░░░▀██▀░░░▄██████████████\n"+"████████████████▄░░░░░░▄████████████████\n"+"██████████████████▄▄▄▄██████████████████\n"+"████████████████████████████████████████\n"+"\n"+message,message, JOptionPane.PLAIN_MESSAGE);
					 JOptionPane.showMessageDialog(null,"░░░░░░░░░░░░░░░░░░\n"+"░░░░▓▓▀▀██████▓▄▒▒░░░\n"+"░░░▀░░░░░░▀▀▀████▄▒░░░\n"+"░░▌░░░░░░░░░░░▀███▓▒░░\n"+"░▌░░░░░▄▄▄░░░░░░▐█▓▒░░░\n"+"░▄▓▀█▌░▀██▀▒▄░░░▐▓▓▓▒░\n"+"░█▌░░░░░▀▒░░░▀░░░▐▓▒▒░░\n"+"░▌▀▒▄▄░░░░░░░░░░░░░▄▒░░\n"+"░▒▄█████▌▒▒░░░░░░░▒▌▒░\n"+"░░▓█████▄▒░▒▒▒░░░░░▐░\n"+"░░▒▀▓▒░░░░░░░▒▒░▒▒▒▄░\n"+"░░▓▒▒▒░░░░░░▒▒▒▒▒░▓░░\n"+"░░████▄▄▄▄▓▓▓▒▒░░▐░░\n"+"░░░▀██████▓▒▒▒▒▒░▐░\n"+"\n"+"В итоги нас погнали эти чудовища на поле боя, вроде,Но хотя нет они нас будуть тренировать!/n","",JOptionPane.PLAIN_MESSAGE);

				 Publicboss.cat();
				 if(Publicboss.suchet == 1){
					 JOptionPane.showMessageDialog(null,"███████████████████▀▀███████████████████\n"+"██████████████████▀░░▀██████████████████\n"+"█████████████▀▀▀▀▀█▄▄█▀▀▀▀▀█████████████\n"+"██████████▀▀░░░░░░░░░░░░░░░░▀▀██████████\n"+"██████████░▄▄▄░░░▄░░░░▄░░░▄▄▄░██████████\n"+"██████████░░▀▀██▄▀▀██▀▀▄██▀▀░░██████████\n"+"██▀▀▀████░░█▄░░░▀▀█░░██▀░░░▄█░░████▀▀▀██\n"+"██▄░░░░██░░░▀██▄▄▄▄██▄▄▄▄██▀░░░██░░░░▄██\n"+"████░▀███░░░░█▄████▀▀████▄█░░░░███▀░████\n"+"█████▄░██░█▄░░▀▀██░░░░█▄▀▀░░▄█░██░▄█████\n"+"██████▄██░▀███▄░▀██▄▄██▀░▄███▀░██▄██████\n"+"█████████░░██░▀██▄░░░░▄██▀░██░░█████████\n"+"█████████░░▄██████▀▀▀▀██████▄░░█████████\n"+"█████████▄██▀░▄▄▄██████▄▄▄░▀██▄█████████\n"+"█████████▄██▀░▄▄▄██████▄▄▄░▀██▄█████████\n"+"████████████░░▀░░░░░░░░░░▀░░████████████\n"+"█████████████▄▄░░░░░░░░░░▄▄█████████████\n"+"████████████████████████████████████████\n"+"Так вон тот раб пригоден поставьте его к тем.\n","",JOptionPane.PLAIN_MESSAGE);


				 }
				 for(;Publicboss.suchet == 2  ;){

					 JOptionPane.showMessageDialog(null,"███████████████████▀▀███████████████████\n"+"██████████████████▀░░▀██████████████████\n"+"█████████████▀▀▀▀▀█▄▄█▀▀▀▀▀█████████████\n"+"██████████▀▀░░░░░░░░░░░░░░░░▀▀██████████\n"+"██████████░▄▄▄░░░▄░░░░▄░░░▄▄▄░██████████\n"+"██████████░░▀▀██▄▀▀██▀▀▄██▀▀░░██████████\n"+"██▀▀▀████░░█▄░░░▀▀█░░██▀░░░▄█░░████▀▀▀██\n"+"██▄░░░░██░░░▀██▄▄▄▄██▄▄▄▄██▀░░░██░░░░▄██\n"+"████░▀███░░░░█▄████▀▀████▄█░░░░███▀░████\n"+"█████▄░██░█▄░░▀▀██░░░░█▄▀▀░░▄█░██░▄█████\n"+"██████▄██░▀███▄░▀██▄▄██▀░▄███▀░██▄██████\n"+"█████████░░██░▀██▄░░░░▄██▀░██░░█████████\n"+"█████████░░▄██████▀▀▀▀██████▄░░█████████\n"+"█████████▄██▀░▄▄▄██████▄▄▄░▀██▄█████████\n"+"█████████▄██▀░▄▄▄██████▄▄▄░▀██▄█████████\n"+"████████████░░▀░░░░░░░░░░▀░░████████████\n"+"█████████████▄▄░░░░░░░░░░▄▄█████████████\n"+"████████████████████████████████████████\n"+"Эй ты еще раз.\n","",JOptionPane.PLAIN_MESSAGE);
					 Publicboss.cat();

				 }
				 JOptionPane.showMessageDialog(null,"███████████████████▀▀███████████████████\n"+"██████████████████▀░░▀██████████████████\n"+"█████████████▀▀▀▀▀█▄▄█▀▀▀▀▀█████████████\n"+"██████████▀▀░░░░░░░░░░░░░░░░▀▀██████████\n"+"██████████░▄▄▄░░░▄░░░░▄░░░▄▄▄░██████████\n"+"██████████░░▀▀██▄▀▀██▀▀▄██▀▀░░██████████\n"+"██▀▀▀████░░█▄░░░▀▀█░░██▀░░░▄█░░████▀▀▀██\n"+"██▄░░░░██░░░▀██▄▄▄▄██▄▄▄▄██▀░░░██░░░░▄██\n"+"████░▀███░░░░█▄████▀▀████▄█░░░░███▀░████\n"+"█████▄░██░█▄░░▀▀██░░░░█▄▀▀░░▄█░██░▄█████\n"+"██████▄██░▀███▄░▀██▄▄██▀░▄███▀░██▄██████\n"+"█████████░░██░▀██▄░░░░▄██▀░██░░█████████\n"+"█████████░░▄██████▀▀▀▀██████▄░░█████████\n"+"█████████▄██▀░▄▄▄██████▄▄▄░▀██▄█████████\n"+"█████████▄██▀░▄▄▄██████▄▄▄░▀██▄█████████\n"+"████████████░░▀░░░░░░░░░░▀░░████████████\n"+"█████████████▄▄░░░░░░░░░░▄▄█████████████\n"+"████████████████████████████████████████\n"+"Так вон тот раб пригоден поставьте его к тем.\n","",JOptionPane.PLAIN_MESSAGE);
				 JOptionPane.showMessageDialog(null,"/n","",JOptionPane.PLAIN_MESSAGE);


					 break;
}




					 // JOptionPane.showMessageDialog(null,"/n","",JOptionPane.PLAIN_MESSAGE);





				}}}
				
